### 작업1유형

In [8]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv')

In [9]:
df.head()

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no

In [5]:
#Question1 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 인원을 가진 나이대는? (0~9 : 0 , 10~19 : 10)

In [10]:
df['age_cate']=df['age']//10*10
df['age_cate'].value_counts().index[0]

30

In [4]:
#Question2 마케팅 응답 고객들의 나이를 10살 단위로 변환 했을 때, 가장 많은 나이대 구간의 인원은 몇명인가?

In [11]:
df['age_cate']=df['age']//10*10
df['age_cate'].value_counts().values[0]

5056

In [ ]:
##Question3 나이가 25살 이상 29살 미만인 응답 고객들중 housing컬럼의 값이 yes인 고객의 수는?

In [12]:
df.head()

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y,age_cate
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no,20
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no,20
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no,30
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no,40
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no,20

In [15]:
len(df[(df['age']>24) &(df['age']<29) &(df['housing']=='yes')])

504

In [ ]:
##Question4 numeric한 값을 가지지 않은 컬럼들중 unique한 값을 가장 많이 가지는 컬럼은?

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12870 entries, 0 to 12869
Data columns (total 18 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         12870 non-null  int64
 1   age        12870 non-null  int64
 2   job        12870 non-null  object
 3   marital    12870 non-null  object
 4   education  12870 non-null  object
 5   default    12870 non-null  object
 6   balance    12870 non-null  int64
 7   housing    12870 non-null  object
 8   loan       12870 non-null  object
 9   contact    12870 non-null  object
 10  day        12870 non-null  int64
 11  month      12870 non-null  object
 12  campaign   12870 non-null  int64
 13  pdays      12870 non-null  int64
 14  previous   12870 non-null  int64
 15  poutcome   12870 non-null  object
 16  y          12870 non-null  object
 17  age_cate   12870 non-null  int64
dtypes: int64(8), object(10)
memory usage: 1.8+ MB

In [19]:
df2=df[['job','marital','education','default','housing','loan','contact','month','poutcome','y']]
df2.head()

,job,marital,education,default,housing,loan,contact,month,poutcome,y
0,technician,single,tertiary,no,no,no,cellular,may,unknown,no
1,services,single,secondary,no,yes,yes,unknown,jun,unknown,no
2,management,single,secondary,no,no,no,cellular,aug,unknown,no
3,technician,married,unknown,no,yes,no,cellular,jul,unknown,no
4,admin.,single,secondary,no,no,yes,unknown,sep,unknown,no

In [20]:
df['job'].nunique()

12

In [26]:
df['month'].nunique()

12

In [17]:
#마님코드
#마님 코드를 해보긴 했지만 복잡할 것 같아서 느낌만
lsg = []
for col in df.select_dtypes(exclude='int'):
    target = df[col]
    lst.append[col, target.nunique()]
    
result = pd.DataFrame(lst).sort_values(1, ascendin)
df.select_dtypes(exclude='int')

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y,age_cate
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no,20
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no,20
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no,30
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no,40
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no,20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
12865,14023,47,technician,married,secondary,no,1167,yes,no,cellular,30,apr,1,87,5,failure,yes,40
12866,17259,31,unknown,married,secondary,no,111,no,no,cellular,21,nov,2,93,2,failure,yes,30
12867,15200,37,unemployed,single,tertiary,no,1316,yes,no,cellular,18,nov,1,172,2,failure,no,30
12868,13775,42,management,married,tertiary,no,479,yes,no,unknown,28,may,2,-1,0,unknown,no,40
12869,20137,24,services,single,secondary,no,0,no,no,unknown,16,may,1,-1,0,unknown,no,20

In [ ]:
##Question5 balance 컬럼값들의 평균값 이상을 가지는 데이터를 ID값을 기준으로 내림차순 정렬했을때 상위 100개 데이터의 balance값의 평균은?

In [ ]:
ans = df[df.balance >= df.balance.mean()].sort_values('ID',ascending=False).head(100).balance.mean()
print(ans)

In [ ]:
##Question6 가장 많은 광고를 집행했던 날짜는 언제인가? (데이터 그대로 일(숫자),달(영문)으로 표기)

In [27]:
df.head()

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y,age_cate
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no,20
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no,20
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no,30
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no,40
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no,20

In [ ]:
ans = df[['day','month']].value_counts().index[0]
print(ans)

In [ ]:
##Question7 데이터의 job이 unknown 상태인 고객들의 age 컬럼 값의 정규성을 검정하고자 한다. 샤피로 검정의 p-value값을 구하여라

In [28]:
ans = df[df['job']=='unknown']

In [32]:
from scipy.stats import shapiro

In [33]:
shapiro(ans['age'])

(0.9784717559814453, 0.1961131989955902)

In [34]:
shapiro(ans['age'])[1]

0.1961131989955902

In [ ]:
##Question8 age와 balance의 상관계수를 구하여라

In [36]:
df[['age','balance']].corr().iloc[0,1]

0.10198734763981472

In [37]:
df[['age','balance']].corr()

              age   balance
age      1.000000  0.101987
balance  0.101987  1.000000

In [ ]:
##Question9 y 변수와 education 변수는 독립인지 카이제곱검정을 통해 확인하려한다. p-value값을 출력하라

In [51]:
from scipy.stats import  chi2_contingency

In [54]:
ans = pd.crosstab(df.y,df.education)
chi2 , p ,dof, expected = chi2_contingency(ans)
display(ans)
print(p)

education  primary  secondary  tertiary  unknown
y
no            1424       4555      2559      365
yes            456       1813      1516      182

7.901201277473551e-29

In [ ]:
##Question10 각 job에 따라 divorced/married 인원의 비율을 확인 했을 때 그 값이 가장 높은 값은?

In [38]:
df.head()`

,ID,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y,age_cate
0,13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no,20
1,22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no,20
2,10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no,30
3,13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no,40
4,11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no,20

In [39]:
df['marital'].unique()

array(['single', 'married', 'divorced'], dtype=object)

In [44]:
ans = df.groupby(['job','marital']).size().reset_index()
ans

              job   marital     0
0          admin.  divorced   207
1          admin.   married   762
2          admin.    single   495
3     blue-collar  divorced   205
4     blue-collar   married  1775
5     blue-collar    single   591
6    entrepreneur  divorced    44
7    entrepreneur   married   272
8    entrepreneur    single    67
9       housemaid  divorced    49
10      housemaid   married   245
11      housemaid    single    40
12     management  divorced   323
13     management   married  1580
14     management    single   955
15        retired  divorced   157
16        retired   married   572
17        retired    single    41
18  self-employed  divorced    39
19  self-employed   married   284
20  self-employed    single   131
21       services  divorced   138
22       services   married   584
23       services    single   321
24        student   married    24
25        student    single   334
26     technician  divorced   246
27     technician   married  1115
28     technician    single   780
29     unemployed  divorced    62
30     unemployed   married   219
31     unemployed    single   133
32        unknown  divorced     5
33        unknown   married    58
34        unknown    single    17

In [45]:
pivot_df = ans.pivot_table(index='job',columns='marital')[0]
pivot_df

marital        divorced  married  single
job
admin.            207.0    762.0   495.0
blue-collar       205.0   1775.0   591.0
entrepreneur       44.0    272.0    67.0
housemaid          49.0    245.0    40.0
management        323.0   1580.0   955.0
retired           157.0    572.0    41.0
self-employed      39.0    284.0   131.0
services          138.0    584.0   321.0
student             NaN     24.0   334.0
technician        246.0   1115.0   780.0
unemployed         62.0    219.0   133.0
unknown             5.0     58.0    17.0

In [47]:
pivot_df = pivot_df.fillna(0)
pivot_df['ratio'] = pivot_df['divorced'] / pivot_df['married']

In [48]:
pivot_df

marital        divorced  married  single     ratio
job
admin.            207.0    762.0   495.0  0.271654
blue-collar       205.0   1775.0   591.0  0.115493
entrepreneur       44.0    272.0    67.0  0.161765
housemaid          49.0    245.0    40.0  0.200000
management        323.0   1580.0   955.0  0.204430
retired           157.0    572.0    41.0  0.274476
self-employed      39.0    284.0   131.0  0.137324
services          138.0    584.0   321.0  0.236301
student             0.0     24.0   334.0  0.000000
technician        246.0   1115.0   780.0  0.220628
unemployed         62.0    219.0   133.0  0.283105
unknown             5.0     58.0    17.0  0.086207

In [50]:
result = pivot_df.sort_values('ratio').ratio.values[-1]
print(result)

0.2831050228310502

### 작업 2유형
- 은행의 전화 마케팅에 대해 고객의 반응 여부

In [61]:
import pandas as pd
train= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/train.csv', index_col='ID')
test= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/test.csv', index_col='ID')
submission= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bank/submission.csv', index_col='ID')

display(train.head())
display(test.head())
display(submission.head())

,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
ID,,,,,,,,,,,,,,,,
13829,29,technician,single,tertiary,no,18254,no,no,cellular,11,may,2,-1,0,unknown,no
22677,26,services,single,secondary,no,512,yes,yes,unknown,5,jun,3,-1,0,unknown,no
10541,30,management,single,secondary,no,135,no,no,cellular,14,aug,2,-1,0,unknown,no
13689,41,technician,married,unknown,no,30,yes,no,cellular,10,jul,1,-1,0,unknown,no
11304,27,admin.,single,secondary,no,321,no,yes,unknown,2,sep,1,-1,0,unknown,no

,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome
ID,,,,,,,,,,,,,,,
53608,32,management,single,tertiary,no,12569,no,no,cellular,1,jul,2,295,2,success
51055,25,services,single,secondary,no,801,no,no,cellular,5,jun,2,-1,0,unknown
52573,46,blue-collar,married,secondary,no,1728,yes,no,unknown,26,may,2,-1,0,unknown
50458,39,management,divorced,secondary,no,51,no,no,unknown,17,jun,2,-1,0,unknown
52272,31,services,single,tertiary,no,1626,no,no,unknown,31,jul,1,-1,0,unknown

       predict
ID
53608      0.0
51055      0.0
52573      0.0
50458      0.0
52272      0.0

In [63]:
x_train = train.copy()

In [64]:
x_test = test.copy()

In [65]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12870 entries, 13829 to 20137
Data columns (total 16 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        12870 non-null  int64
 1   job        12870 non-null  object
 2   marital    12870 non-null  object
 3   education  12870 non-null  object
 4   default    12870 non-null  object
 5   balance    12870 non-null  int64
 6   housing    12870 non-null  object
 7   loan       12870 non-null  object
 8   contact    12870 non-null  object
 9   day        12870 non-null  int64
 10  month      12870 non-null  object
 11  campaign   12870 non-null  int64
 12  pdays      12870 non-null  int64
 13  previous   12870 non-null  int64
 14  poutcome   12870 non-null  object
 15  y          12870 non-null  object
dtypes: int64(6), object(10)
memory usage: 1.7+ MB

In [66]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4291 entries, 53608 to 51945
Data columns (total 15 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4291 non-null   int64
 1   job        4291 non-null   object
 2   marital    4291 non-null   object
 3   education  4291 non-null   object
 4   default    4291 non-null   object
 5   balance    4291 non-null   int64
 6   housing    4291 non-null   object
 7   loan       4291 non-null   object
 8   contact    4291 non-null   object
 9   day        4291 non-null   int64
 10  month      4291 non-null   object
 11  campaign   4291 non-null   int64
 12  pdays      4291 non-null   int64
 13  previous   4291 non-null   int64
 14  poutcome   4291 non-null   object
dtypes: int64(6), object(9)
memory usage: 536.4+ KB

In [67]:
# 인코딩 할 데이터만 따로 만들어주기
x_train_encoding = x_train[['job','marital','education','default','housing','loan','contact','month','poutcome']]
x_train_encoding

,job,marital,education,default,housing,loan,contact,month,poutcome
ID,,,,,,,,,
13829,technician,single,tertiary,no,no,no,cellular,may,unknown
22677,services,single,secondary,no,yes,yes,unknown,jun,unknown
10541,management,single,secondary,no,no,no,cellular,aug,unknown
13689,technician,married,unknown,no,yes,no,cellular,jul,unknown
11304,admin.,single,secondary,no,no,yes,unknown,sep,unknown
...,...,...,...,...,...,...,...,...,...
14023,technician,married,secondary,no,yes,no,cellular,apr,failure
17259,unknown,married,secondary,no,no,no,cellular,nov,failure
15200,unemployed,single,tertiary,no,yes,no,cellular,nov,failure
13775,management,married,tertiary,no,yes,no,unknown,may,unknown
20137,services,single,secondary,no,no,no,unknown,may,unknown

In [68]:
x_test_encoding = x_test[['job','marital','education','default','housing','loan','contact','month','poutcome']]
x_test_encoding

,job,marital,education,default,housing,loan,contact,month,poutcome
ID,,,,,,,,,
53608,management,single,tertiary,no,no,no,cellular,jul,success
51055,services,single,secondary,no,no,no,cellular,jun,unknown
52573,blue-collar,married,secondary,no,yes,no,unknown,may,unknown
50458,management,divorced,secondary,no,no,no,unknown,jun,unknown
52272,services,single,tertiary,no,no,no,unknown,jul,unknown
...,...,...,...,...,...,...,...,...,...
50332,admin.,married,secondary,no,no,no,telephone,feb,unknown
51293,technician,married,secondary,no,no,no,cellular,nov,success
54023,admin.,married,secondary,no,yes,no,cellular,nov,unknown
53775,blue-collar,married,secondary,no,no,no,cellular,jul,other
51945,self-employed,married,primary,no,no,no,cellular,aug,unknown

In [69]:
y_train = x_train[['y']]
y_train

         y
ID
13829   no
22677   no
10541   no
13689   no
11304   no
...    ...
14023  yes
17259  yes
15200   no
13775   no
20137   no

[12870 rows x 1 columns]

In [70]:
temp = pd.concat([x_train_encoding, x_test_encoding], axis=0)
temp_encoding = pd.get_dummies(temp)
temp_encoding

,job_admin.,job_blue-collar,job_entrepreneur,job_housemaid,job_management,job_retired,job_self-employed,job_services,job_student,job_technician,...,month_jun,month_mar,month_may,month_nov,month_oct,month_sep,poutcome_failure,poutcome_other,poutcome_success,poutcome_unknown
ID,,,,,,,,,,,,,,,,,,,,,
13829,0,0,0,0,0,0,0,0,0,1,...,0,0,1,0,0,0,0,0,0,1
22677,0,0,0,0,0,0,0,1,0,0,...,1,0,0,0,0,0,0,0,0,1
10541,0,0,0,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
13689,0,0,0,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,1
11304,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
50332,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
51293,0,0,0,0,0,0,0,0,0,1,...,0,0,0,1,0,0,0,0,1,0
54023,1,0,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,1
53775,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
51945,0,0,0,0,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [71]:
x_train_encoding = temp_encoding.iloc[:12870]
x_test_encoding = temp_encoding.iloc[12870:]
x_train_encoding.shape, x_test_encoding.shape

((12870, 44), (4291, 44))

In [72]:
x_train.drop(['job','marital','education','default','housing','loan','contact','month','poutcome','y'],axis=1, inplace=True)

In [73]:
x_train

       age  balance  day  campaign  pdays  previous
ID
13829   29    18254   11         2     -1         0
22677   26      512    5         3     -1         0
10541   30      135   14         2     -1         0
13689   41       30   10         1     -1         0
11304   27      321    2         1     -1         0
...    ...      ...  ...       ...    ...       ...
14023   47     1167   30         1     87         5
17259   31      111   21         2     93         2
15200   37     1316   18         1    172         2
13775   42      479   28         2     -1         0
20137   24        0   16         1     -1         0

[12870 rows x 6 columns]

In [75]:
x_test.drop(['job','marital','education','default','housing','loan','contact','month','poutcome'],axis=1, inplace=True)

In [76]:
x_test

       age  balance  day  campaign  pdays  previous
ID
53608   32    12569    1         2    295         2
51055   25      801    5         2     -1         0
52573   46     1728   26         2     -1         0
50458   39       51   17         2     -1         0
52272   31     1626   31         1     -1         0
...    ...      ...  ...       ...    ...       ...
50332   47      520    9         6     -1         0
51293   33      133   12         2    192         1
54023   40     2574   20         1     -1         0
53775   39     2467   19         2    276         3
51945   46       49   27         6     -1         0

[4291 rows x 6 columns]

In [77]:
#원데이터랑 합치기
x_train = pd.concat([x_train,x_train_encoding], axis=1)
x_test = pd.concat([x_test,x_test_encoding], axis=1)

In [78]:
x_train.head()

,age,balance,day,campaign,pdays,previous,job_admin.,job_blue-collar,job_entrepreneur,job_housemaid,...,month_jun,month_mar,month_may,month_nov,month_oct,month_sep,poutcome_failure,poutcome_other,poutcome_success,poutcome_unknown
ID,,,,,,,,,,,,,,,,,,,,,
13829,29,18254,11,2,-1,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1
22677,26,512,5,3,-1,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,1
10541,30,135,14,2,-1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
13689,41,30,10,1,-1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
11304,27,321,2,1,-1,0,1,0,0,0,...,0,0,0,0,0,1,0,0,0,1

In [79]:
from sklearn.ensemble import RandomForestClassifier

In [80]:
from sklearn.model_selection import cross_val_score, GridSearchCV

In [81]:
from sklearn.metrics import roc_auc_score
from sklearn.model_selection import cross_val_score, GridSearchCV
from sklearn.model_selection import train_test_split

In [84]:
model = RandomForestClassifier()
result = cross_val_score(model, x_train, y_train, cv=5)
result.mean()

C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:516: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:516: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:516: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:516: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:516: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)

0.763713250671831

In [85]:
model.fit(x_train, y_train)

C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)
C:\Users\HJ\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  """Entry point for launching an IPython kernel.

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [101]:
pre = model.predict(x_test)

In [96]:
pre

array(['yes', 'yes', 'no', ..., 'no', 'no', 'no'], dtype=object)

In [102]:
pred = model.predict_proba(x_test)

In [98]:
pred

array([[0.2, 0.8],
       [0. , 1. ],
       [1. , 0. ],
       ...,
       [0.9, 0.1],
       [0.5, 0.5],
       [1. , 0. ]])

In [104]:
dic = {'ID':x_test.index, 'pred':pre}
submit = pd.DataFrame(dic)
submit

         ID pred
0     53608  yes
1     51055  yes
2     52573   no
3     50458   no
4     52272   no
...     ...  ...
4286  50332   no
4287  51293  yes
4288  54023   no
4289  53775   no
4290  51945   no

[4291 rows x 2 columns]